{"_type": "author", "name": "Amara Okafor", "slug": {"_type": "slug", "current": "amara-okafor"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "Amara is AfroVogue's lead fashion curator with over 8 years of experience in African fashion. Born in Lagos and raised between Nigeria and Kenya, she brings a deep understanding of contemporary African style and traditional textiles. Amara holds a degree in Fashion Design from the University of Arts London and is passionate about showcasing the versatility of African prints in modern wardrobes."}]}], "image": null}
{"_type": "author", "name": "Kesi Mwangi", "slug": {"_type": "slug", "current": "kesi-mwangi"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "Kesi is our cultural heritage specialist and storyteller. With a background in African Studies from the University of Nairobi, she researches the rich history behind traditional fabrics and patterns. Kesi travels across East Africa documenting textile traditions and connecting with local artisans to bring authentic stories to the AfroVogue community."}]}], "image": null}
{"_type": "author", "name": "Thandiwe Ndaba", "slug": {"_type": "slug", "current": "thandiwe-ndaba"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "Thandiwe is AfroVogue's sustainability advocate and ethical fashion expert. Based in Cape Town, she oversees our partnerships with local artisan communities and ensures our production meets the highest ethical standards. She holds an MBA in Sustainable Business and is committed to promoting responsible fashion that uplifts African communities."}]}], "image": null}
{"_type": "author", "name": "David Asante", "slug": {"_type": "slug", "current": "david-asante"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "David brings a fresh perspective to African menswear and unisex styling. Originally from Accra, Ghana, he specializes in contemporary interpretations of traditional African garments. David's styling work has been featured in several African fashion magazines, and he's passionate about breaking gender stereotypes in African fashion."}]}], "image": null}
{"_type": "author", "name": "Fatima Al-Rashid", "slug": {"_type": "slug", "current": "fatima-al-rashid"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "Fatima is our trend forecaster and market analyst, specializing in the intersection of African fashion and global trends. With her base in Marrakech and extensive travel across Africa, she identifies emerging designers and upcoming trends before they hit the mainstream. Fatima has a keen eye for what's next in African fashion."}]}], "image": null}
{"_type": "author", "name": "AfroVogue Editorial", "slug": {"_type": "slug", "current": "afrovogue-editorial"}, "bio": [{"_type": "block", "style": "normal", "children": [{"_type": "span", "text": "The AfroVogue Editorial Team consists of fashion enthusiasts, cultural researchers, and industry experts dedicated to bringing you the best in African fashion content. From product spotlights to cultural deep-dives, our editorial team ensures every piece of content reflects our commitment to celebrating African heritage through fashion."}]}], "image": null}